v2206/multiphase_condensateEvaporate/constant/phaseChangeProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseChangeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseChangeTwoPhaseModel constant;

constantCoeffs
{
    // coeffC          150;    // the higher the value the faster the condensation
    // coeffE          150;    // the higher the value the faster the evaporation
   
    coeffC          250;  
    coeffE          250;    
}


// ************************************************************************* //
