v2206/multiphase_condensateEvaporate/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (liquid vapour); // water

sigma
{
    type                constant;
    sigma               0.07;
}

Prt             0.7;

liquid
{
    transportModel  Newtonian;
    nu              1e-6;
    rho             998;

    Cp              4.186e3;
    Cv              4.186e3;   // assume Cp for liquid
    kappa           0.6;
    hf              -2.4e6;
}

vapour
{
    transportModel  Newtonian;
    nu              1.8e-08;
    rho             0.56;

    Cp              1.87e3;     // water vapour
    Cv              1.41e3;     // Cv = Cp - R/w
    kappa           0.026;      // water vapour
    hf              0;
}


// liquid
// {
//     transportModel  Newtonian;
//     nu              2.64e-7;
//     rho             1583.4;

//     Cp              1.1072e3;
//     Cv              1.1072e3;   // assume Cp for liquid
//     kappa           0.057;
//     hf              0;
// }

// vapour
// {
//     transportModel  Newtonian;
//     nu              5e-7;
//     rho             14.9;

//     Cp              895.2;      // FC72 vapour
//     Cv              870.4;      // Cv = Cp - R/w
//     kappa           0.01;       // FC72 vapour
//     hf              93.0e3;
// }



// ************************************************************************* //
