v2206/multiphase_condensateEvaporate/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 360;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 375;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    left
    {
        type            zeroGradient;
        value           $internalField;
    }

    right
    {
        type            zeroGradient;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// boundaryField
// {
//     bottom
//     {
//         type            zeroGradient;
//     }

//     top
//     {
//         type            inletOutlet;
//         inletValue      $internalField;
//         value           $internalField;
//     }

//     left
//     {
//         type            fixedValue;
//         value           uniform 360;
//     }

//     right
//     {
//         type            zeroGradient;
//         value           $internalField;
//     }

//     frontAndBack
//     {
//         type            empty;
//     }
// }


// ************************************************************************* //
