v2206/multiphase_condensateEvaporate/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid    0
    volScalarFieldValue alpha.vapour    1
    // volScalarFieldValue T               375
);

regions
(
    boxToCell
    {
        box (0 0 0) (1 0.08 1);
        fieldValues
        (
            volScalarFieldValue alpha.liquid    1
            volScalarFieldValue alpha.vapour    0
            volScalarFieldValue T               365
        );
    }
);


// regions
// (
//     boxToCell
//     {
//         box (0.00   0.00   0.00) (0.5  1.0   1.0);
//         fieldValues
//         (
//             volScalarFieldValue alpha.liquid 1
//             volScalarFieldValue T 372.9
//         );
//     }
// );


// regions
// (
//     boxToCell
//     {
//         box (0.00   0.00   0.00) (0.02  0.0025   0.01);
//         fieldValues
//         (
//             volScalarFieldValue alpha.liquid 1
//             volScalarFieldValue T 365
//         );
//     }
// );



// defaultFieldValues
// (
//     volScalarFieldValue alpha.liquid 0
//     volScalarFieldValue T 375
// );

// regions
// (
//     boxToCell
//     {
//         box (0.00   0.00   0.00) (0.02  0.0025   0.01);
//         fieldValues
//         (
//             volScalarFieldValue alpha.liquid 1
//             // volScalarFieldValue alpha.vapour 0
//             volScalarFieldValue T 365
//         );
//     }
// );


// ************************************************************************* //
